<template>
  <div class="faq-wrapper">
    <h2 class="title">Поширенні запитання</h2>
    <div class="accordion">
      <div v-for="item in items"
           :key="item.title"
           class="item"
           :class="{active: item.active}"
      >
        <h2 class="item-title" @click="changeActive(item)">
          {{ item.title }}
          <div class="arrow-wrapper">
            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                d="M17.2946 9.29461C16.9053 8.90534 16.2743 8.905 15.8846 9.29384L12 13.17L8.11538 9.29385C7.72568 8.905 7.09466 8.90534 6.70538 9.29462V9.29462C6.31581 9.68419 6.31581 10.3158 6.70538 10.7054L11.2929 15.2929C11.6834 15.6834 12.3166 15.6834 12.7071 15.2929L17.2946 10.7054C17.6842 10.3158 17.6842 9.68419 17.2946 9.29461V9.29461Z"
                fill="#202124" fill-opacity="0.38"/>
            </svg>
          </div>
        </h2>
        <p class="item-text" v-html="item.text"></p>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  name: 'FAQ',
  data() {
    return {
      items: [
        {
          title: 'Нова пошта працює?',
          text: "Від початку повномасштабної війни росії проти України Нова пошта не зупиняє роботу. Ми робимо все можливе, щоб ви могли надсилати та отримувати посилки, грошові перекази. \n" +
            "            Перелік відділень, які працюють, та графік роботи оновлюється щодня за посиланням: \n" +
            "            <a target=\"_blank\" href=\"https://novaposhta.ua/news/rubric/2/id/10171\">https://novaposhta.ua/news/rubric/2/id/10171</a>",
          active: false
        },
        {
          title: 'Як я можу відправити/отримати посилку?',
          text: "Відправити/отримати посилку наразі ви можете у відділенні. Доставка в поштомат працює в обласних центрах. Кур\'єрська доставка працює всюди по Україні, окрім особливо небезпечних районів. \n" +
            "            Зверніть увагу, для того, щоб відправити/отримати посилку у відділенні, перш за все вам необхідно перевірити, чи працює це відділення, і чи приймає воно посилки на відправку.\n" +
            "            Перелік відділень, які працюють, та графік роботи оновлюється щодня за посиланням: \n" +
            "            <a target=\"_blank\" href=\"https://novaposhta.ua/news/rubric/2/id/10171\">https://novaposhta.ua/news/rubric/2/id/10171</a>",
          active: false
        },
        {
          title: 'Чи можна отримати посилку у поштоматі?',
          text: "Наразі отримати посилку можна в одному з 1500 поштоматів, але лише в обласних центрах України. Перелік поштоматів, які працюють, оновлюється щодня за посиланням: <a target=\"_blank\" href=\"https://novaposhta.ua/news/rubric/2/id/10171\">https://novaposhta.ua/news/rubric/2/id/10171</a> або у мобільному додатку.",
          active: false
        },
        {
          title: 'Чи нараховується плата за зберігання посилки?',
          text: "До 20 березня 2022 року зберігання посилок безкоштовне. З 21 березня 2022 року за зберігання нараховується плата.",
          active: false
        },
        {
          title: 'Чи можна відправити посилку з накладеним платежем (післяплатою)?',
          text: "Ви можете відправити посилку із накладеним платежем (післяплатою). Комісію зменшено, наразі вона складає 0,5% від суми, щонайменше 5 грн.",
          active: false
        },
        {
          title: 'Як працюють відділення?',
          text: "Перелік відділень, які працюють, та графік роботи оновлюється щодня за посиланням: \n" +
            "<a target=\"_blank\" href=\"https://novaposhta.ua/news/rubric/2/id/10171\">https://novaposhta.ua/news/rubric/2/id/10171</a>\n" +
            "Деякі відділення можуть працювати тільки на отримання посилок.\n" +
            "\n" +
            "Також користуйтесь чат-ботом в Телеграм: <a target=\"_blank\" href=\"https://t.me/npu_info_bot\">https://t.me/npu_info_bot</a>. \n" +
            "Чат-бот:\n" +
            "1.        підкаже, чи працює потрібне вам відділення \n" +
            "2.        підкаже, які відділення працюють у потрібному населеному пункті та за яким графіком\n" +
            "3.        порадить найближчі відділення, які працюють, у випадку якщо ваше закрите.\n",
          active: false
        },
        {
          title: 'Що мені робити, якщо я не можу забрати посилку у відділенні?',
          text: "Якщо ви не можете забрати посилку у відділенні, замовте її переадресацію у будь-яке інше відділення, що працює. До 20 березня 2022 року послуга переадресації безкоштовна. З 21 березня 2022 року послуга переадресації платна. Замовити переадресацію можна за допомогою мобільного додатку, трекінгу, контакт-центру.  \n" +
            "\n" +
            "Перелік відділень, які працюють, та графік роботи оновлюється щодня за посиланням: \n" +
            "\n" +
            "<a target=\"_blank\" href=\"https://novaposhta.ua/news/rubric/2/id/10171\">https://novaposhta.ua/news/rubric/2/id/10171</a>",
          active: false
        },
        {
          title: 'Що мені робити, якщо моя посилка у відділенні, яке не працює?',
          text: "Якщо ваша посилка знаходиться у відділенні, яке наразі не працює, замовте переадресацію посилки у будь-яке інше працююче відділення. Щойно ми зможемо забрати посилку із непрацюючого відділення, ми відправимо її на інше. До 20 березня 2022 року послуга переадресації безкоштовна. З 21 березня 2022 року послуга переадресації платна. Замовити переадресацію можна за допомогою мобільного додатку, трекінгу, контакт-центру.  \n" +
            "\n" +
            "Перелік відділень, які працюють, та графік роботи оновлюється щодня за посиланням: \n" +
            "\n" +
            "<a target=\"_blank\" href=\"https://novaposhta.ua/news/rubric/2/id/10171\">https://novaposhta.ua/news/rubric/2/id/10171</a>",
          active: false
        },
        {
          title: 'Чи працює доставка кур\'єром? ',
          text: "Кур'єрська доставка працює — всюди по Україні, окрім особливо небезпечних районів. Також ви можете зробити заявку на забір з адреси - на <a target=\"_blank\" href=\"https://novaposhta.ua/onlineorder\">сайті</a>, зателефонувавши до контакт-центру чи створивши інтернет-накладну в Бізнес-кабінеті чи в мобільному додатку.",
          active: false
        },
        {
          title: 'Чи компенсують мені втрату чи пошкодження посилки?',
          text: "Наразі виплати компенсацій за претензіями призупинено.",
          active: false
        },
        {
          title: 'Чи є обмеження за розмірами та вагою посилок?',
          text: "Наразі обмежень за вагою та габаритами посилок немає.",
          active: false
        },
        {
          title: 'Чи можна відправляти продукти харчування?',
          text: "Продукти харчування відправляти можна.",
          active: false
        },
        {
          title: 'Чи можна відправляти військове спорядження?',
          text: "Військове спорядження відправляти можна. Не можна відправляти вогнепальну і пневматичну зброю та її частини, боєприпаси, холодну зброю.",
          active: false
        },
        {
          title: 'Які терміни доставки? ',
          text: "Наразі ми перебудовуємо маршрути, адже не хочемо наражати на небезпеку наших водіїв. Тому ми не можемо передбачити точний строк доставки і гарантувати терміни, вказані у експрес-накладній. Проте ми намагатимемось доставити вашу посилку якнайшвидше.\n",
          active: false
        },
        {
          title: 'Як мені дізнатись, де перебуває моя посилка?',
          text: "Дізнатися місце перебування посилки, переадресувати або оплатити послуги доставки ви можете у трекінгу Нова пошта за посиланням <a target=\"_blank\" href=\"https://tracking.novaposhta.ua/#/uk\">https://tracking.novaposhta.ua/#/uk</a> або у мобільному додатку.",
          active: false
        },
        {
          title: 'Чи можна отримати у відділенні грошовий переказ, у тому числі міжнародний?',
          text: "У відділенні ви можете:\n" +
            "\n" +
            "-отримати грошовий переказ по Україні (комісія 0,5% від суми, але не менше 5 грн)\n" +
            "-отримати міжнародний грошовий переказ Western Union та Ria (комісія 0 грн до 31.03.22)\n" +
            "-отримати готівку з картки (комісія 0,5% від суми, але не менше 5 грн)\n" +
            "\n" +
            "Детальніше про умови надання фінансових послуг:\n" +
            "<a target=\"_blank\" href=\"https://novapay.ua/\">https://novapay.ua</a>",
          active: false
        },
        {
          title: 'Чи можу я отримати посилку з-за кордону?',
          text: "Ви можете замовити і отримати посилку в Україну із-за кордону за допомогою Нова пошта Шопінг (окрім Туреччини та Китаю).\n" +
            "Детальніше на сайті <a target=\"_blank\" href=\"http://npshopping.com/\">http://npshopping.com/</a>\n" +
            "Список заборонених до відправки вантажів за <a target=\"_blank\" href=\"https://novaposhta.ua/uploads/misc/doc/forbidden_goods_uk.pdf\">посиланням</a>.",
          active: false
        },
        {
          title: 'Я хочу відправити посилку закордон. Що треба зробити?',
          text: "Для того, щоб відправити посилку закордон, необхідно:\n" +
            "\n" +
            "1. Принести посилку у будь-яке відділення Нової пошти, яке працює.\n" +
            "\n" +
            "Зверніть увагу на те, що оператору потрібно буде зробити загальний опис вмісту посилки відповідно до митного законодавства та встановити оголошену вартість.\n" +
            "\n" +
            "Перелік відділень, які працюють, та графік роботи оновлюється щодня за посиланням: \n" +
            "<a target=\"_blank\" href=\"https://novaposhta.ua/news/rubric/2/id/10171\">https://novaposhta.ua/news/rubric/2/id/10171</a>\n" +
            "\n" +
            "2. Назвати країну, місто, індекс та точну адресу, куди потрібно доставити посилку.\n" +
            "3. Назвати ПІБ, контактний телефон та адресу електронної пошти одержувача\n" +
            "\n" +
            "Зверніть увагу на те, що при надсиланні більше однієї позиції з одержувачем обов'язково зв'яжеться співробітник Нової пошти Глобал для заповнення інвойсу для митниці.\n" +
            "\n" +
            "Перед відправкою важливо ознайомитися з митним законодавством країни, до якої хочете відправити відправлення, а також пам'ятати, що митні платежі у країні одержувача завжди сплачує сам одержувач.\n" +
            "\n" +
            "Також заявку на міжнародне відправлення можна оформити в особистому кабінеті на сайті Нової пошти.",
          active: false
        },
        {
          title: 'Чи можу я замовити товари в інтернет-магазинах із доставкою Новою поштою?',
          text: "Так, доставка з інтернет-магазинів працює. Список інтернет-магазинів за посиланням: <a target=\"_blank\" href=\"https://novaposhta.ua/ecompromo/\">https://novaposhta.ua/ecompromo/</a>",
          active: false
        },
      ]
    }
  },
  methods: {
    changeActive(item) {
      const itemState = item.active;
      for (let i = 0; i < this.items.length; i += 1) {
        this.items[i].active = false;
      }
      item.active = !itemState;
      if (item.active) {
        this.$gtm.push({
          event_category: 'FAQ_click',
          event_action: item.title,
          event: 'custom_event'
        })
      }
    }
  }
}
</script>
<style scoped lang="scss">
.faq-wrapper {
  .title {
    margin-top: 0;
    color: rgba(51, 51, 47, 1);
  }

  .accordion {
    background: #F2F2F5;

    .item {
      position: relative;

      .arrow-wrapper {
        position: absolute;
        right: 0;
        top: 0;
        bottom: 0;
        margin: auto;
        display: flex;
        align-items: center;
        transform: rotate(0);
        transition: transform .2s ease-out;
      }

      .item-title {
        color: #33332F;
        margin: 0;
        position: relative;
      }

      .item-text {
        color: #33332F;
        max-height: 0;
        transition: all .2s ease-out;
        overflow: hidden;
        margin: 0;
        box-sizing: border-box;
      }

      &.active {
        .arrow-wrapper {
          transform: rotate(180deg);
        }

        .item-text {
          max-height: unset;
        }
      }
    }
  }
}

@media only screen and (min-width: 1025px) {
  .faq-wrapper {
    margin-bottom: 70px;

    .title {
      margin-bottom: 40px;
      font-size: 32px;
      line-height: 38px;
    }

    .accordion {
      padding: 16px 40px;

      .item {

        &:not(:last-child) {
          border-bottom: 1px solid #E5E5E5;
        }

        .item-title {
          font-size: 20px;
          cursor: pointer;
          padding: 24px 40px 24px 0;
        }

        .item-text {
          font-size: 20px;
          line-height: 28px;
        }

        &.active {
          .item-text {
            padding-bottom: 24px;
          }
        }
      }
    }
  }
}

@media only screen and (max-width: 1024px) {
  .faq-wrapper {
    margin-bottom: 48px;
    padding-top: 48px;

    .title {
      padding: 0 24px;
      margin-bottom: 24px;
      font-size: 20px;
      line-height: 24px;
    }

    .accordion {
      padding: 8px 24px;

      .item {

        &:not(:last-child) {
          border-bottom: 1px solid #E5E5E5;
        }

        .item-title {
          font-size: 14px;
          line-height: 17px;
          padding: 13.5px 40px 13.5px 0;
        }

        .item-text {
          font-size: 12px;
          line-height: 17px;
        }

        &.active {
          .item-text {
            padding-bottom: 13.5px;
          }
        }
      }
    }
  }
}

</style>
<style lang="scss">
.faq-wrapper {

  .accordion {

    .item {
      .item-text {
        a {
          text-decoration: none;
          color: rgb(77, 147, 230)
        }
      }
    }
  }
}
</style>
